{
    "data" : {
        "color1" : "#f5e5c9",
        "color2" : "#171616",
        "header1" : "Joshua Guo",
        "attributes" : [
            "Undergrad @ Stony Brook University",
            "            Computer Science",
            "            Applied Mathematics",
            "            3.97 GPA",
            "Avid Learner",
            "Novice Mechanical Keyboard Enthusiast",
            "Aspiring Software Engineer",
            "Former Intern @ Fidelity Investments",
            "Incoming Intern @ Facebook"
        ],
        "header2" : "Projects",
        "projects" : [
            {
                "name" : "ControlLED",
                "description" : "During the Covid-19 quarantine, I created this webapp to allow my friends to communicate with my via LED lights in my room. Using Node and Express, I created a REST API to read / write from a queue of LED messages in MongoDB to accompany a simple UI for users to customize the lights and attach a message. Additionally, I had to code and wire an Arduino to be able to read from the queue and adjust the lights accordingly.",
                "tech" : ["React.js, Node.js, HTML, CSS, MongoDB, Arudino"],
                "demo" : true,
                "demo_link" : "",
                "github" : true,
                "github_link" : ""
            },
            {
                "name": "Portfolio",
                "description": "The portfolio you're looking at right now! Working on this digital portfolio has helped me better understand principles of clean and minimalistic web design. Additionally, maintenance and updating of the data (like this paragraph) can all be done through basic modification of a JSON file. Super simple!",
                "tech": ["ReactJS"]
            },
            {
                "name" : "PlanIt",
                "description" : "PlanIt is an ongoing project that began as a way for me to learn JS and HTML, but has transitioned into a larger scale project with the goal of making a platform to create quick and easy shareable todo-lists on the fly across mobile and web platforms.",
                "tech" : ["ReactJS", "React Native", "Java", "Spring Boot"],
                "demo": false
            },
            {
                "name" : "Revibe",
                "description" : "My first completed hackathon project, developed alongside three teammates. Microsoft Azure FaceAPI processes webcam footage and the resulting data affects what messages the user sees.",
                "tech" : ["ReactJS", "Azure Face API"],
                "demo" : false,
                "github" : true,
                "github_link" : ""
            },
            {
                "name" : "Save",
                "description" : "My final project for my Honors Object-Oriented Programming class meant to leverage the various OOP principles that I had learned over the semester. JavaFX nodes in the GUI reinforced polymorphism concepts and I had to create multiple objects with methods to keep track of users' spending history.",
                "tech" : ["Java"],
                "demo" : false,
                "github" : true,
                "github_link" : ""
            }
            
        ]
    }
}